{
  /* This file contains configuration for the menus in the layout. 
   * It allows you to make most changes to menus without recompiling the source code, 
   * thereby letting designers quickly build their theme
   * It has three sections:
   * - Version is simply a version number, to better control when the code expects a different structure
   * - Menus which uses a string-key to identify a configuration, and determins which pages should be shown
   * - Designs uses a string key as well, and determines look and feel through CSS-Classes added to the HTML
   *
   * Note: This is a JSON file but the parser will treat it as JSONC, so you can add comments
  */

  // The version of this file, which helps the reader detect the format (or error if incompatible)
  // TODO:
  "version": 0.01,

  // TODO:
  "layout": {
    "logo": "[ASSETS-PATH]/logo.svg",
    "languageMenuShow": true,
    "languageMenuShowMin":  2
  },

  // TODO:
  "languages": {
    "hideOthers":  false,
    "list": [
      {
        "culture": "en",
        "label": "ENG",
        "description": "English"
      },
      {
        "culture": "de-CH",
        "label": "DEU"
      }
    ]
  },

  // Menus contain the configuration for each menu. The names used are specified in the Razor files.
  "Menus": {
    // Main is usually used for the default, top-level menu
    "Main": {
      "start": "*",
      "depth": 2
    },
    // Mobile is usually used for the default, top-level menu which only appears when the screen is too small
    "Mobile": {
      "start": "*",
      "depth": 2
    },
    // Sidebar is used in menus usually to the left of content
    "Sidebar": {
      "start": "*",
      "depth": 2,
      "design": "Sidebar"
    },
    // Todo: not implemented yet
    "ImprintPrivacy": {
      "depth": 0,
      "pageList": [
        28,
        31
      ]
    }
  },

  // Designs specify how the output is made, what classes added to each node etc.
  // It's separate from the Menus, since it could be re-used
  "Designs": {
    "Sidebar": {
      "parts": {
        "a": {
          "classes": "nav-link",
          "active": "active"
        },
        "li": {
          "classes": "nav-item nav-[PAGEID] position-relative",
          "hasChildren": "has-child",
          "active": "active",
          "disabled": "disabled"
        },
        "ul": {
          "byLevel": {
            "0": "navbar-nav XYZ",
            "-1": "collapse to-shine-submenu-[PAGEID]"
          }
        }
      }
    }
  }
}